'''Роботы нашли зашифрованное сообщение.
На данный момент мы не можем его расшифровать, но можем сделать первые шаги в этом направлении.
У вас есть набор «слов», все в нижнем регистре, и каждое слово содержит символы в «алфавитном порядке».
(это не ваш типичный алфавитный порядок, а новый и другой порядок.)
Нам нужно определить порядок символов из каждого «слова» и создать одно «слово» со всеми этими символами,
разместив их в новом алфавитном порядке.
В некоторых случаях, если мы не можем определить порядок нескольких символов,
следует использовать традиционный латинский алфавитный порядок. Например: даны слова «acb», «bd», «zwa».
Как мы видим, «z» и «w» должны стоять перед «a» и «d» после «b». Итак, результат - «zwacbd».'''